export const ICONSARR = [
  {
    icon: <i className="fas fa-file-powerpoint" />,
    text: "약관동의",
  },
  {
    icon: <i className="fas fa-file-signature" />,
    text: "개인정보입력",
  },
  {
    icon: <i className="fas fa-user-check" />,
    text: "가입완료",
  },
];

export const AgreementBoxData = {
  AgreeItems: [
    {
      name: "agreeAll",
      text: "티웨이항공 일반규정, 개인정보 수집 및 이용, 마케팅 활용 동의 모두 동의합니다.",
    },
    {
      name: "tangWayPolicy",
      text: "티웨이항공 홈페이지 이용약관 동의",
      content: `2000년 초에 중국에서 데뷔한 후 여러 드라마에서 활약하는 알려진 배우였으나, 2007년 세계적인 거장인 이안 감독의 <색, 계>에서 주인공 왕자즈(막부인) 역으로 활약하면서 일약 세계적으로 주목받는 배우가 되었다.

      단아하면서도 묘하게 고혹적인 이미지로 왕자즈의 여러 모습을 훌륭하게 잘 연기했다는 평. 베드신의 높은 수위와 눈빛 연기도 매우 화제였다. 하지만 영화 내의 겨털[3] 노출 논란과 항일운동을 하던 왕자즈가 일본과 결탁한 매국 괴뢰정부인 왕징웨이 정부 인사와 가지게 되는 사랑의 감정, 그리고 그 마지막 무언가의 논란 때문에 중국 내에서의 활동은 제한받게 되었다고 한다. 이에 대한 자세한 설명은 색, 계 참조.
      
      이후 약 1억 8천만 원 상당의 금액을 들고 영국으로 떠나서 살게 된다. 길거리 모델이나 초상화를 그리는 일을 하면서 돈을 모으게 되고, 그러면서 공부도 했다고 한다. 그러면서 활동이 좀 뜸했다가[4] 홍콩 시민권을 취득하고 주로 홍콩에서 활동했다. 이때 출연한 영화가 로맨틱 코미디인 "크로싱 헤네시"이다. 홍콩 4대천왕 중 한 명인 장학우와 함께 나왔는데, 부스스한 스타일에 소박한 화장을 하고도 미모가 빛을 발한지라, 농담 반 진담 반으로 이 영화는 한국 팬들 사이에서는 움직이는 탕웨이 화보집으로 통한다(…).
      
      그 후 <색, 계>를 인상적으로 본 한국 영화 관계자들과 인연이 닿아 2011년작 김태용 감독의 영화 <만추>에서 현빈과 함께 출연하게 된다. 당시 인터뷰에서의 둘의 친근한 행동 및 현빈의 해병대 첫 휴가와 탕웨이의 한국 방문이 우연히 맞아떨어져 둘이 사귀는 것 아니냐는 소문이 퍼지기도 했지만, 지금 와서 보면 단순 루머였다(...). <만추>로 제47회 백상예술대상에서 여우주연상을 외국인 배우 최초로 수상하는 등 방한한 적이 꽤 있다.
      
      탕웨이로서는 이 "만추"가 회심의 작품이 되는데, 일단 중국에서 "색계" 이후의 활동정지기간 때문에 잊히던 걸 이 작품의 흥행으로 다시 재기의 발판을 마련했고, 마침 이때부터 중국 활동 정지가 풀리면서 이후 중국에서 톱스타로 발돋음하는 계기가 된다. 그래서 <색, 계>를 감독한 이안 감독이 탕웨이가 "만추"에 출연하게 된 것에 대해 한국 관계자들과 한국 팬들에게 고맙게 생각한다고 말한 바 있다.
      
      2013년 개봉한 로맨틱 코미디 영화 <시절인연>이 중국 현지에서 역대 로맨틱 코미디물 흥행 1위는 물론 역대 중국 박스오피스 20위 안에 드는 등 놀라운 흥행을 기록하면서 탕웨이는 명실공히 중국 내에서도 손꼽히는 톱 배우의 자리를 굳혔다.
      
      2014년 마이클 만의 <블랙햇>에 출연해 본격적으로 헐리우드에 진출했다. 그러나 막상 뚜껑을 열어보니 영화는 망작 취급을 받고 있고, 설상가상 흥행도 역대급 폭망 수준이 되어서 노장 감독인 마이클 만은 물론이고, 탕웨이도 할리우드에서의 앞날이 밝지만은 않아 보인다.
      
      2019년 드라마 대명황비손약미전으로 10여 년 만에 브라운관에 복귀한다. 소설 '육조기사'를 원작으로 한 드라마로, 명나라 성조 시기를 배경으로 '손약미[5]'라는 여인의 일대기를 그린다. 약 8개월간 촬영을 마친 후 2019년 방영 예정이다.`,
      required: "[필수]",
    },
    {
      name: "privacyPolicy",
      text: "개인정보 수집 및 이용약관",
      content: `장동건과 함께 코오롱 스포츠의 모델을 수 년째 하고 있으며, 부산국제영화제에서 안성기와 사회를 보기도 했으며 청룡영화상에 시상자로 출연하기도 하였다.
      2012년 1~2월경에는 간판모델 김희애를 대신해[10] SK-2 새 모델로 임수정과 투탑 광고도 찍었다. 사실 탕웨이는 한국뿐만 아니라 중화권 SK-2 공식모델이기도 했는데[11], 한국에서 인기가 많아지면서 한국과 중화권 SK-2 광고에 동시에 출연하게 된 것. 영화에서와는 달리 이 광고에서는 20대 여성같이 발랄한 모습을 보여 기존 <색, 계>로만 탕웨이를 접한 사람들을 놀라게 하였다. 노취지 아늘 커에요
      국내 유명 메이크업 아티스트 정샘물이 탕웨이의 메이크업을 한 것으로 화제가 되기도 했다. 세바퀴에 출연해서 탕웨이의 메이크업을 맡은 이후에 탕웨이가 훨씬 어려보이고 예뻐져서 이후에 탕웨이 메이크업을 하러 중국이나 홍콩을 가기도 하고, 심지어 탕웨이 결혼식 화장까지 맡았다고 한다. 사실 정샘물이 맡기 전까지 탕웨이의 메이크업은 부자연스럽고 나이들어보이는 메이크업이 주였는데, 정샘물이 메이크업을 맡은 이후부터 청순하고 세련된 이미지를 많이 선보였다.`,
      required: "[필수]",
    },
    {
      name: "marketingPolicy",
      text: "마케팅 및 광고 활용 동의",
      content: `본래는 중국 국적이며 중국 본토 출신이지만 중국 내에서의 활동 제약 때문에 홍콩 영주권을 취득한 후에 홍콩 연예계를 통해 다시 활동할 수 있게 되었다. 중국 국적의 홍콩 영주권자는 중국 여권이 아닌 홍콩 여권을 사용하며, 해외에서도 중국 국적이 아닌 홍콩 특별행정구라는 별도의 국적코드를 부여받는다. 사실상 해외에서는 중국과 다른 별개의 국적으로 대우받는 셈이다. 또한 중국 본토에 호적이 없으며, 공무 담임권도 없고, 납세의 의무도 없으며, 이중국적이 허용되고, 여권도 다르다.
        [2] 탕웨이의 딸은 대한민국과 홍콩의 이중국적이다. 중국계 홍콩인의 자녀가 홍콩에서 출생하면 홍콩 영주권과 홍콩 여권이 부여되며, 중국은 이중국적을 허용하지 않지만 예외적으로 홍콩 여권을 가진 사람에게는 이중국적이 허용된다. 그리고 한국은 부모 중 한 명이 한국 국적이면 출생국가와 상관없이 한국 국적을 부여한다. 2010년 5월 4일부터 선천적인 복수국적 여성은 만 22세 전까지 외국 국적 불행사 서약을 하는 조건 하에 복수국적을 허용하도록 대한민국 국적법이 개정되었다.
        [3] 항목에서 볼 수 있지만 겨드랑이털은 한때 성적 심볼이기도 했다. 당시의 그러한 경향을 재현하기 위해 평소 깎고 다니던 걸 일부러 길러서 출연했다고 한다.
        [4] 중간에 히치콕 영화 재현 화보에 참가했다. 난파선의 승객 중 하나가 바로 탕웨이.
        [5] 후일 선덕제의 황후가 되는 효공장황후 손씨를 모티브로 삼은 듯 하다.
        [6] 여담으로 골프선수 안병훈의 아버지인 안재형과 어머니 자오즈민도 스웨덴에서 결혼식을 올린 바 있다. 참고로 안재형과 자오즈민은 탁구 선수 출신 부부.
        [7] 공산당의 선전영화인데, 탕웨이는 타오이라는 마오쩌둥의 첫 연인을 맡았다. 하지만 노출연기로 논란이 있었기 때문에 국부인 마오쩌둥의 연인 역을 맡기에 이미지가 맞지 않다고 판단, 당의 요청으로 탕웨이 출연분량은 모두 삭제되었다.
        [8] 중국의 천재여류작가인 샤오홍의 일대기를 다룬 영화. 부산국제영화제에 초청된 이후 정식 개봉했다.
        [9] 박찬욱 감독 신작
        [10] 김희애는 2009년부터 메인 모델이었을만큼 장수 모델이었다.
        [11] 탕웨이뿐만 아니라 영화 도둑들에서 금고털이 줄리 역으로 나온 배우 이심결도 중화권 SK-2 모델이라서 중화권 SK-2 광고에는 이 둘이 투탑으로 나오기도 했다.
        [12] 최동훈 감독과 함께 시네마 천국을 진행하기도 했다.
        [13] 2012년에 탕웨이가 경기도 성남시 분당구에 토지를 구입하고 등기를 위해 외국인 등록번호까지 발급받은 것을 들어 "당시부터 사귀고 있는 것 아니냐"는 말도 나오지만, 변영주 감독 등 김태용 감독 지인들의 이야기나 본인들의 이야기로는 2012년 열애설 당시에는 연인관계가 아니었다고 한다. 2013년 중국 파파라치가 찍은 사진을 봐도 탕웨이는 당시 다른 사람과 연인관계였던 것으로 보인다. 김태용 감독과 탕웨이가 밝힌 것처럼 2013년 10월 이후에 연인관계로 발전했다는 이야기가 맞는 듯하다.
        [14] 이민자가 많은 사회인 미국에서 특히 더 그렇다. 오히려 매력적인 이성이 이국적인 액센트를 가지면 완벽한 미국 General American 액센트를 구사할 때보다 더 좋아라 하는 경향도 있다. 미국에서 백인 남성이 유럽이나 영국 액센트를 쓰면 기이하리만큼 대접을 잘 받는다. 비슷하게, 오리엔탈리즘적인 시선이 다소 있는 입장이긴 하지만, 여성의 경우 동아시아 쪽 액센트를 가지면 그건 그 나름대로 추가적인 매력으로 간주된다. 하지만 아시안 남성이 아시안 액센트를 가졌다면...`,
      required: "[선택]",
    },
  ],
};
